garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f04q20.inc
// Register: DMA2PR
#define DMA2PR DMA2PR
DMA2PR                                   equ 003Ch
// bitfield definitions
DMA2PR_PR_POSN                           equ 0000h
DMA2PR_PR_POSITION                       equ 0000h
DMA2PR_PR_SIZE                           equ 0003h
DMA2PR_PR_LENGTH                         equ 0003h
DMA2PR_PR_MASK                           equ 0007h
DMA2PR_PR0_POSN                          equ 0000h
DMA2PR_PR0_POSITION                      equ 0000h
DMA2PR_PR0_SIZE                          equ 0001h
DMA2PR_PR0_LENGTH                        equ 0001h
DMA2PR_PR0_MASK                          equ 0001h
DMA2PR_PR1_POSN                          equ 0001h
DMA2PR_PR1_POSITION                      equ 0001h
DMA2PR_PR1_SIZE                          equ 0001h
DMA2PR_PR1_LENGTH                        equ 0001h
DMA2PR_PR1_MASK                          equ 0002h
DMA2PR_PR2_POSN                          equ 0002h
DMA2PR_PR2_POSITION                      equ 0002h
DMA2PR_PR2_SIZE                          equ 0001h
DMA2PR_PR2_LENGTH                        equ 0001h
DMA2PR_PR2_MASK                          equ 0004h
DMA2PR_DMA2PR_POSN                       equ 0000h
DMA2PR_DMA2PR_POSITION                   equ 0000h
DMA2PR_DMA2PR_SIZE                       equ 0003h
DMA2PR_DMA2PR_LENGTH                     equ 0003h
DMA2PR_DMA2PR_MASK                       equ 0007h
DMA2PR_DMA2PR0_POSN                      equ 0000h
DMA2PR_DMA2PR0_POSITION                  equ 0000h
DMA2PR_DMA2PR0_SIZE                      equ 0001h
DMA2PR_DMA2PR0_LENGTH                    equ 0001h
DMA2PR_DMA2PR0_MASK                      equ 0001h
DMA2PR_DMA2PR1_POSN                      equ 0001h
DMA2PR_DMA2PR1_POSITION                  equ 0001h
DMA2PR_DMA2PR1_SIZE                      equ 0001h
DMA2PR_DMA2PR1_LENGTH                    equ 0001h
DMA2PR_DMA2PR1_MASK                      equ 0002h
DMA2PR_DMA2PR2_POSN                      equ 0002h
DMA2PR_DMA2PR2_POSITION                  equ 0002h
DMA2PR_DMA2PR2_SIZE                      equ 0001h
DMA2PR_DMA2PR2_LENGTH                    equ 0001h
DMA2PR_DMA2PR2_MASK                      equ 0004h

// Register: DMA3PR
#define DMA3PR DMA3PR
DMA3PR                                   equ 003Dh
// bitfield definitions
DMA3PR_PR_POSN                           equ 0000h
DMA3PR_PR_POSITION                       equ 0000h
DMA3PR_PR_SIZE                           equ 0003h
DMA3PR_PR_LENGTH                         equ 0003h
DMA3PR_PR_MASK                           equ 0007h
DMA3PR_PR0_POSN                          equ 0000h
DMA3PR_PR0_POSITION                      equ 0000h
DMA3PR_PR0_SIZE                          equ 0001h
DMA3PR_PR0_LENGTH                        equ 0001h
DMA3PR_PR0_MASK                          equ 0001h
DMA3PR_PR1_POSN                          equ 0001h
DMA3PR_PR1_POSITION                      equ 0001h
DMA3PR_PR1_SIZE                          equ 0001h
DMA3PR_PR1_LENGTH                        equ 0001h
DMA3PR_PR1_MASK                          equ 0002h
DMA3PR_PR2_POSN                          equ 0002h
DMA3PR_PR2_POSITION                      equ 0002h
DMA3PR_PR2_SIZE                          equ 0001h
DMA3PR_PR2_LENGTH                        equ 0001h
DMA3PR_PR2_MASK                          equ 0004h
DMA3PR_DMA3PR_POSN                       equ 0000h
DMA3PR_DMA3PR_POSITION                   equ 0000h
DMA3PR_DMA3PR_SIZE                       equ 0003h
DMA3PR_DMA3PR_LENGTH                     equ 0003h
DMA3PR_DMA3PR_MASK                       equ 0007h
DMA3PR_DMA3PR0_POSN                      equ 0000h
DMA3PR_DMA3PR0_POSITION                  equ 0000h
DMA3PR_DMA3PR0_SIZE                      equ 0001h
DMA3PR_DMA3PR0_LENGTH                    equ 0001h
DMA3PR_DMA3PR0_MASK                      equ 0001h
DMA3PR_DMA3PR1_POSN                      equ 0001h
DMA3PR_DMA3PR1_POSITION                  equ 0001h
DMA3PR_DMA3PR1_SIZE                      equ 0001h
DMA3PR_DMA3PR1_LENGTH                    equ 0001h
DMA3PR_DMA3PR1_MASK                      equ 0002h
DMA3PR_DMA3PR2_POSN                      equ 0002h
DMA3PR_DMA3PR2_POSITION                  equ 0002h
DMA3PR_DMA3PR2_SIZE                      equ 0001h
DMA3PR_DMA3PR2_LENGTH                    equ 0001h
DMA3PR_DMA3PR2_MASK                      equ 0004h

// Register: DMA4PR
#define DMA4PR DMA4PR
DMA4PR                                   equ 003Eh
// bitfield definitions
DMA4PR_PR_POSN                           equ 0000h
DMA4PR_PR_POSITION                       equ 0000h
DMA4PR_PR_SIZE                           equ 0003h
DMA4PR_PR_LENGTH                         equ 0003h
DMA4PR_PR_MASK                           equ 0007h
DMA4PR_PR0_POSN                          equ 0000h
DMA4PR_PR0_POSITION                      equ 0000h
DMA4PR_PR0_SIZE                          equ 0001h
DMA4PR_PR0_LENGTH                        equ 0001h
DMA4PR_PR0_MASK                          equ 0001h
DMA4PR_PR1_POSN                          equ 0001h
DMA4PR_PR1_POSITION                      equ 0001h
DMA4PR_PR1_SIZE                          equ 0001h
DMA4PR_PR1_LENGTH                        equ 0001h
DMA4PR_PR1_MASK                          equ 0002h
DMA4PR_PR2_POSN                          equ 0002h
DMA4PR_PR2_POSITION                      equ 0002h
DMA4PR_PR2_SIZE                          equ 0001h
DMA4PR_PR2_LENGTH                        equ 0001h
DMA4PR_PR2_MASK                          equ 0004h
DMA4PR_DMA4PR_POSN                       equ 0000h
DMA4PR_DMA4PR_POSITION                   equ 0000h
DMA4PR_DMA4PR_SIZE                       equ 0003h
DMA4PR_DMA4PR_LENGTH                     equ 0003h
DMA4PR_DMA4PR_MASK                       equ 0007h
DMA4PR_DMA4PR0_POSN                      equ 0000h
DMA4PR_DMA4PR0_POSITION                  equ 0000h
DMA4PR_DMA4PR0_SIZE                      equ 0001h
DMA4PR_DMA4PR0_LENGTH                    equ 0001h
DMA4PR_DMA4PR0_MASK                      equ 0001h
DMA4PR_DMA4PR1_POSN                      equ 0001h
DMA4PR_DMA4PR1_POSITION                  equ 0001h
DMA4PR_DMA4PR1_SIZE                      equ 0001h
DMA4PR_DMA4PR1_LENGTH                    equ 0001h
DMA4PR_DMA4PR1_MASK                      equ 0002h
DMA4PR_DMA4PR2_POSN                      equ 0002h
DMA4PR_DMA4PR2_POSITION                  equ 0002h
DMA4PR_DMA4PR2_SIZE                      equ 0001h
DMA4PR_DMA4PR2_LENGTH                    equ 0001h
DMA4PR_DMA4PR2_MASK                      equ 0004h

// Register: SCANPR
#define SCANPR SCANPR
SCANPR                                   equ 003Fh
// bitfield definitions
SCANPR_PR_POSN                           equ 0000h
SCANPR_PR_POSITION                       equ 0000h
SCANPR_PR_SIZE                           equ 0003h
SCANPR_PR_LENGTH                         equ 0003h
SCANPR_PR_MASK                           equ 0007h
SCANPR_PR0_POSN                          equ 0000h
SCANPR_PR0_POSITION                      equ 0000h
SCANPR_PR0_SIZE                          equ 0001h
SCANPR_PR0_LENGTH                        equ 0001h
SCANPR_PR0_MASK                          equ 0001h
SCANPR_PR1_POSN                          equ 0001h
SCANPR_PR1_POSITION                      equ 0001h
SCANPR_PR1_SIZE                          equ 0001h
SCANPR_PR1_LENGTH                        equ 0001h
SCANPR_PR1_MASK                          equ 0002h
SCANPR_PR2_POSN                          equ 0002h
SCANPR_PR2_POSITION                      equ 0002h
SCANPR_PR2_SIZE                          equ 0001h
SCANPR_PR2_LENGTH                        equ 0001h
SCANPR_PR2_MASK                          equ 0004h
SCANPR_SCANPR_POSN                       equ 0000h
SCANPR_SCANPR_POSITION                   equ 0000h
SCANPR_SCANPR_SIZE                       equ 0003h
SCANPR_SCANPR_LENGTH                     equ 0003h
SCANPR_SCANPR_MASK                       equ 0007h
SCANPR_SCANPR0_POSN                      equ 0000h
SCANPR_SCANPR0_POSITION                  equ 0000h
SCANPR_SCANPR0_SIZE                      equ 0001h
SCANPR_SCANPR0_LENGTH                    equ 0001h
SCANPR_SCANPR0_MASK                      equ 0001h
SCANPR_SCANPR1_POSN                      equ 0001h
SCANPR_SCANPR1_POSITION                  equ 0001h
SCANPR_SCANPR1_SIZE                      equ 0001h
SCANPR_SCANPR1_LENGTH                    equ 0001h
SCANPR_SCANPR1_MASK                      equ 0002h
SCANPR_SCANPR2_POSN                      equ 0002h
SCANPR_SCANPR2_POSITION                  equ 0002h
SCANPR_SCANPR2_SIZE                      equ 0001h
SCANPR_SCANPR2_LENGTH                    equ 0001h
SCANPR_SCANPR2_MASK                      equ 0004h

