garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f04q20.inc
// Register: I3C1DCR
#define I3C1DCR I3C1DCR
I3C1DCR                                  equ 00A9h
// bitfield definitions
I3C1DCR_DCR_POSN                         equ 0000h
I3C1DCR_DCR_POSITION                     equ 0000h
I3C1DCR_DCR_SIZE                         equ 0008h
I3C1DCR_DCR_LENGTH                       equ 0008h
I3C1DCR_DCR_MASK                         equ 00FFh

// Register: I3C1DSTAT0
#define I3C1DSTAT0 I3C1DSTAT0
I3C1DSTAT0                               equ 00AAh
// bitfield definitions
I3C1DSTAT0_INTPEND_POSN                  equ 0000h
I3C1DSTAT0_INTPEND_POSITION              equ 0000h
I3C1DSTAT0_INTPEND_SIZE                  equ 0004h
I3C1DSTAT0_INTPEND_LENGTH                equ 0004h
I3C1DSTAT0_INTPEND_MASK                  equ 000Fh
I3C1DSTAT0_PERR_POSN                     equ 0005h
I3C1DSTAT0_PERR_POSITION                 equ 0005h
I3C1DSTAT0_PERR_SIZE                     equ 0001h
I3C1DSTAT0_PERR_LENGTH                   equ 0001h
I3C1DSTAT0_PERR_MASK                     equ 0020h
I3C1DSTAT0_ACTMODE_POSN                  equ 0006h
I3C1DSTAT0_ACTMODE_POSITION              equ 0006h
I3C1DSTAT0_ACTMODE_SIZE                  equ 0002h
I3C1DSTAT0_ACTMODE_LENGTH                equ 0002h
I3C1DSTAT0_ACTMODE_MASK                  equ 00C0h
I3C1DSTAT0_INPEND0_POSN                  equ 0000h
I3C1DSTAT0_INPEND0_POSITION              equ 0000h
I3C1DSTAT0_INPEND0_SIZE                  equ 0001h
I3C1DSTAT0_INPEND0_LENGTH                equ 0001h
I3C1DSTAT0_INPEND0_MASK                  equ 0001h
I3C1DSTAT0_INTPEND1_POSN                 equ 0001h
I3C1DSTAT0_INTPEND1_POSITION             equ 0001h
I3C1DSTAT0_INTPEND1_SIZE                 equ 0001h
I3C1DSTAT0_INTPEND1_LENGTH               equ 0001h
I3C1DSTAT0_INTPEND1_MASK                 equ 0002h
I3C1DSTAT0_INTPEND2_POSN                 equ 0002h
I3C1DSTAT0_INTPEND2_POSITION             equ 0002h
I3C1DSTAT0_INTPEND2_SIZE                 equ 0001h
I3C1DSTAT0_INTPEND2_LENGTH               equ 0001h
I3C1DSTAT0_INTPEND2_MASK                 equ 0004h
I3C1DSTAT0_INTPEND3_POSN                 equ 0003h
I3C1DSTAT0_INTPEND3_POSITION             equ 0003h
I3C1DSTAT0_INTPEND3_SIZE                 equ 0001h
I3C1DSTAT0_INTPEND3_LENGTH               equ 0001h
I3C1DSTAT0_INTPEND3_MASK                 equ 0008h
I3C1DSTAT0_ACTMODE0_POSN                 equ 0006h
I3C1DSTAT0_ACTMODE0_POSITION             equ 0006h
I3C1DSTAT0_ACTMODE0_SIZE                 equ 0001h
I3C1DSTAT0_ACTMODE0_LENGTH               equ 0001h
I3C1DSTAT0_ACTMODE0_MASK                 equ 0040h
I3C1DSTAT0_ACTMODE1_POSN                 equ 0007h
I3C1DSTAT0_ACTMODE1_POSITION             equ 0007h
I3C1DSTAT0_ACTMODE1_SIZE                 equ 0001h
I3C1DSTAT0_ACTMODE1_LENGTH               equ 0001h
I3C1DSTAT0_ACTMODE1_MASK                 equ 0080h

// Register: I3C1DSTAT1
#define I3C1DSTAT1 I3C1DSTAT1
I3C1DSTAT1                               equ 00ABh
// bitfield definitions
I3C1DSTAT1_VRSV_POSN                     equ 0000h
I3C1DSTAT1_VRSV_POSITION                 equ 0000h
I3C1DSTAT1_VRSV_SIZE                     equ 0008h
I3C1DSTAT1_VRSV_LENGTH                   equ 0008h
I3C1DSTAT1_VRSV_MASK                     equ 00FFh
I3C1DSTAT1_VRSV0_POSN                    equ 0000h
I3C1DSTAT1_VRSV0_POSITION                equ 0000h
I3C1DSTAT1_VRSV0_SIZE                    equ 0001h
I3C1DSTAT1_VRSV0_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV0_MASK                    equ 0001h
I3C1DSTAT1_VRSV1_POSN                    equ 0001h
I3C1DSTAT1_VRSV1_POSITION                equ 0001h
I3C1DSTAT1_VRSV1_SIZE                    equ 0001h
I3C1DSTAT1_VRSV1_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV1_MASK                    equ 0002h
I3C1DSTAT1_VRSV2_POSN                    equ 0002h
I3C1DSTAT1_VRSV2_POSITION                equ 0002h
I3C1DSTAT1_VRSV2_SIZE                    equ 0001h
I3C1DSTAT1_VRSV2_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV2_MASK                    equ 0004h
I3C1DSTAT1_VRSV3_POSN                    equ 0003h
I3C1DSTAT1_VRSV3_POSITION                equ 0003h
I3C1DSTAT1_VRSV3_SIZE                    equ 0001h
I3C1DSTAT1_VRSV3_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV3_MASK                    equ 0008h
I3C1DSTAT1_VRSV4_POSN                    equ 0004h
I3C1DSTAT1_VRSV4_POSITION                equ 0004h
I3C1DSTAT1_VRSV4_SIZE                    equ 0001h
I3C1DSTAT1_VRSV4_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV4_MASK                    equ 0010h
I3C1DSTAT1_VRSV5_POSN                    equ 0005h
I3C1DSTAT1_VRSV5_POSITION                equ 0005h
I3C1DSTAT1_VRSV5_SIZE                    equ 0001h
I3C1DSTAT1_VRSV5_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV5_MASK                    equ 0020h
I3C1DSTAT1_VRSV6_POSN                    equ 0006h
I3C1DSTAT1_VRSV6_POSITION                equ 0006h
I3C1DSTAT1_VRSV6_SIZE                    equ 0001h
I3C1DSTAT1_VRSV6_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV6_MASK                    equ 0040h
I3C1DSTAT1_VRSV7_POSN                    equ 0007h
I3C1DSTAT1_VRSV7_POSITION                equ 0007h
I3C1DSTAT1_VRSV7_SIZE                    equ 0001h
I3C1DSTAT1_VRSV7_LENGTH                  equ 0001h
I3C1DSTAT1_VRSV7_MASK                    equ 0080h

// Register: I3C1MWS
#define I3C1MWS I3C1MWS
I3C1MWS                                  equ 00ACh
// bitfield definitions
I3C1MWS_MWS0_POSN                        equ 0000h
I3C1MWS_MWS0_POSITION                    equ 0000h
I3C1MWS_MWS0_SIZE                        equ 0001h
I3C1MWS_MWS0_LENGTH                      equ 0001h
I3C1MWS_MWS0_MASK                        equ 0001h
I3C1MWS_MWS1_POSN                        equ 0001h
I3C1MWS_MWS1_POSITION                    equ 0001h
I3C1MWS_MWS1_SIZE                        equ 0001h
I3C1MWS_MWS1_LENGTH                      equ 0001h
I3C1MWS_MWS1_MASK                        equ 0002h
I3C1MWS_MWS2_POSN                        equ 0002h
I3C1MWS_MWS2_POSITION                    equ 0002h
I3C1MWS_MWS2_SIZE                        equ 0001h
I3C1MWS_MWS2_LENGTH                      equ 0001h
I3C1MWS_MWS2_MASK                        equ 0004h
I3C1MWS_MWS3_POSN                        equ 0003h
I3C1MWS_MWS3_POSITION                    equ 0003h
I3C1MWS_MWS3_SIZE                        equ 0001h
I3C1MWS_MWS3_LENGTH                      equ 0001h
I3C1MWS_MWS3_MASK                        equ 0008h
I3C1MWS_MWS4_POSN                        equ 0004h
I3C1MWS_MWS4_POSITION                    equ 0004h
I3C1MWS_MWS4_SIZE                        equ 0001h
I3C1MWS_MWS4_LENGTH                      equ 0001h
I3C1MWS_MWS4_MASK                        equ 0010h
I3C1MWS_MWS5_POSN                        equ 0005h
I3C1MWS_MWS5_POSITION                    equ 0005h
I3C1MWS_MWS5_SIZE                        equ 0001h
I3C1MWS_MWS5_LENGTH                      equ 0001h
I3C1MWS_MWS5_MASK                        equ 0020h
I3C1MWS_MWS6_POSN                        equ 0006h
I3C1MWS_MWS6_POSITION                    equ 0006h
I3C1MWS_MWS6_SIZE                        equ 0001h
I3C1MWS_MWS6_LENGTH                      equ 0001h
I3C1MWS_MWS6_MASK                        equ 0040h
I3C1MWS_MWS7_POSN                        equ 0007h
I3C1MWS_MWS7_POSITION                    equ 0007h
I3C1MWS_MWS7_SIZE                        equ 0001h
I3C1MWS_MWS7_LENGTH                      equ 0001h
I3C1MWS_MWS7_MASK                        equ 0080h
I3C1MWS_MWS_2_0_POSN                     equ 0000h
I3C1MWS_MWS_2_0_POSITION                 equ 0000h
I3C1MWS_MWS_2_0_SIZE                     equ 0003h
I3C1MWS_MWS_2_0_LENGTH                   equ 0003h
I3C1MWS_MWS_2_0_MASK                     equ 0007h
I3C1MWS_MWS_7_4_POSN                     equ 0004h
I3C1MWS_MWS_7_4_POSITION                 equ 0004h
I3C1MWS_MWS_7_4_SIZE                     equ 0004h
I3C1MWS_MWS_7_4_LENGTH                   equ 0004h
I3C1MWS_MWS_7_4_MASK                     equ 00F0h

// Register: I3C1MRS
#define I3C1MRS I3C1MRS
I3C1MRS                                  equ 00ADh
// bitfield definitions
I3C1MRS_MRS0_POSN                        equ 0000h
I3C1MRS_MRS0_POSITION                    equ 0000h
I3C1MRS_MRS0_SIZE                        equ 0001h
I3C1MRS_MRS0_LENGTH                      equ 0001h
I3C1MRS_MRS0_MASK                        equ 0001h
I3C1MRS_MRS1_POSN                        equ 0001h
I3C1MRS_MRS1_POSITION                    equ 0001h
I3C1MRS_MRS1_SIZE                        equ 0001h
I3C1MRS_MRS1_LENGTH                      equ 0001h
I3C1MRS_MRS1_MASK                        equ 0002h
I3C1MRS_MRS2_POSN                        equ 0002h
I3C1MRS_MRS2_POSITION                    equ 0002h
I3C1MRS_MRS2_SIZE                        equ 0001h
I3C1MRS_MRS2_LENGTH                      equ 0001h
I3C1MRS_MRS2_MASK                        equ 0004h
I3C1MRS_MRS3_POSN                        equ 0003h
I3C1MRS_MRS3_POSITION                    equ 0003h
I3C1MRS_MRS3_SIZE                        equ 0001h
I3C1MRS_MRS3_LENGTH                      equ 0001h
I3C1MRS_MRS3_MASK                        equ 0008h
I3C1MRS_MRS4_POSN                        equ 0004h
I3C1MRS_MRS4_POSITION                    equ 0004h
I3C1MRS_MRS4_SIZE                        equ 0001h
I3C1MRS_MRS4_LENGTH                      equ 0001h
I3C1MRS_MRS4_MASK                        equ 0010h
I3C1MRS_MRS5_POSN                        equ 0005h
I3C1MRS_MRS5_POSITION                    equ 0005h
I3C1MRS_MRS5_SIZE                        equ 0001h
I3C1MRS_MRS5_LENGTH                      equ 0001h
I3C1MRS_MRS5_MASK                        equ 0020h
I3C1MRS_MRS6_POSN                        equ 0006h
I3C1MRS_MRS6_POSITION                    equ 0006h
I3C1MRS_MRS6_SIZE                        equ 0001h
I3C1MRS_MRS6_LENGTH                      equ 0001h
I3C1MRS_MRS6_MASK                        equ 0040h
I3C1MRS_MRS7_POSN                        equ 0007h
I3C1MRS_MRS7_POSITION                    equ 0007h
I3C1MRS_MRS7_SIZE                        equ 0001h
I3C1MRS_MRS7_LENGTH                      equ 0001h
I3C1MRS_MRS7_MASK                        equ 0080h
I3C1MRS_MRS_2_0_POSN                     equ 0000h
I3C1MRS_MRS_2_0_POSITION                 equ 0000h
I3C1MRS_MRS_2_0_SIZE                     equ 0003h
I3C1MRS_MRS_2_0_LENGTH                   equ 0003h
I3C1MRS_MRS_2_0_MASK                     equ 0007h
I3C1MRS_MRS_5_3_POSN                     equ 0003h
I3C1MRS_MRS_5_3_POSITION                 equ 0003h
I3C1MRS_MRS_5_3_SIZE                     equ 0003h
I3C1MRS_MRS_5_3_LENGTH                   equ 0003h
I3C1MRS_MRS_5_3_MASK                     equ 0038h

// Register: I3C1MRT
#define I3C1MRT I3C1MRT
I3C1MRT                                  equ 00AEh

