garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f04q20.inc
// Register: SPI1TCNTH
#define SPI1TCNTH SPI1TCNTH
SPI1TCNTH                                equ 01DAh
// bitfield definitions
SPI1TCNTH_TCNTH_POSN                     equ 0000h
SPI1TCNTH_TCNTH_POSITION                 equ 0000h
SPI1TCNTH_TCNTH_SIZE                     equ 0003h
SPI1TCNTH_TCNTH_LENGTH                   equ 0003h
SPI1TCNTH_TCNTH_MASK                     equ 0007h

// Register: SPI1CON0
#define SPI1CON0 SPI1CON0
SPI1CON0                                 equ 01DBh
// bitfield definitions
SPI1CON0_BMODE_POSN                      equ 0000h
SPI1CON0_BMODE_POSITION                  equ 0000h
SPI1CON0_BMODE_SIZE                      equ 0001h
SPI1CON0_BMODE_LENGTH                    equ 0001h
SPI1CON0_BMODE_MASK                      equ 0001h
SPI1CON0_MST_POSN                        equ 0001h
SPI1CON0_MST_POSITION                    equ 0001h
SPI1CON0_MST_SIZE                        equ 0001h
SPI1CON0_MST_LENGTH                      equ 0001h
SPI1CON0_MST_MASK                        equ 0002h
SPI1CON0_LSBF_POSN                       equ 0002h
SPI1CON0_LSBF_POSITION                   equ 0002h
SPI1CON0_LSBF_SIZE                       equ 0001h
SPI1CON0_LSBF_LENGTH                     equ 0001h
SPI1CON0_LSBF_MASK                       equ 0004h
SPI1CON0_EN_POSN                         equ 0007h
SPI1CON0_EN_POSITION                     equ 0007h
SPI1CON0_EN_SIZE                         equ 0001h
SPI1CON0_EN_LENGTH                       equ 0001h
SPI1CON0_EN_MASK                         equ 0080h
SPI1CON0_SPI1BMODE_POSN                  equ 0000h
SPI1CON0_SPI1BMODE_POSITION              equ 0000h
SPI1CON0_SPI1BMODE_SIZE                  equ 0001h
SPI1CON0_SPI1BMODE_LENGTH                equ 0001h
SPI1CON0_SPI1BMODE_MASK                  equ 0001h
SPI1CON0_SPI1MST_POSN                    equ 0001h
SPI1CON0_SPI1MST_POSITION                equ 0001h
SPI1CON0_SPI1MST_SIZE                    equ 0001h
SPI1CON0_SPI1MST_LENGTH                  equ 0001h
SPI1CON0_SPI1MST_MASK                    equ 0002h
SPI1CON0_SPI1LSBF_POSN                   equ 0002h
SPI1CON0_SPI1LSBF_POSITION               equ 0002h
SPI1CON0_SPI1LSBF_SIZE                   equ 0001h
SPI1CON0_SPI1LSBF_LENGTH                 equ 0001h
SPI1CON0_SPI1LSBF_MASK                   equ 0004h
SPI1CON0_SPI1SPIEN_POSN                  equ 0007h
SPI1CON0_SPI1SPIEN_POSITION              equ 0007h
SPI1CON0_SPI1SPIEN_SIZE                  equ 0001h
SPI1CON0_SPI1SPIEN_LENGTH                equ 0001h
SPI1CON0_SPI1SPIEN_MASK                  equ 0080h

// Register: SPI1CON1
#define SPI1CON1 SPI1CON1
SPI1CON1                                 equ 01DCh
// bitfield definitions
SPI1CON1_SDOP_POSN                       equ 0000h
SPI1CON1_SDOP_POSITION                   equ 0000h
SPI1CON1_SDOP_SIZE                       equ 0001h
SPI1CON1_SDOP_LENGTH                     equ 0001h
SPI1CON1_SDOP_MASK                       equ 0001h
SPI1CON1_SDIP_POSN                       equ 0001h
SPI1CON1_SDIP_POSITION                   equ 0001h
SPI1CON1_SDIP_SIZE                       equ 0001h
SPI1CON1_SDIP_LENGTH                     equ 0001h
SPI1CON1_SDIP_MASK                       equ 0002h
SPI1CON1_SSP_POSN                        equ 0002h
SPI1CON1_SSP_POSITION                    equ 0002h
SPI1CON1_SSP_SIZE                        equ 0001h
SPI1CON1_SSP_LENGTH                      equ 0001h
SPI1CON1_SSP_MASK                        equ 0004h
SPI1CON1_FST_POSN                        equ 0004h
SPI1CON1_FST_POSITION                    equ 0004h
SPI1CON1_FST_SIZE                        equ 0001h
SPI1CON1_FST_LENGTH                      equ 0001h
SPI1CON1_FST_MASK                        equ 0010h
SPI1CON1_CKP_POSN                        equ 0005h
SPI1CON1_CKP_POSITION                    equ 0005h
SPI1CON1_CKP_SIZE                        equ 0001h
SPI1CON1_CKP_LENGTH                      equ 0001h
SPI1CON1_CKP_MASK                        equ 0020h
SPI1CON1_CKE_POSN                        equ 0006h
SPI1CON1_CKE_POSITION                    equ 0006h
SPI1CON1_CKE_SIZE                        equ 0001h
SPI1CON1_CKE_LENGTH                      equ 0001h
SPI1CON1_CKE_MASK                        equ 0040h
SPI1CON1_SMP_POSN                        equ 0007h
SPI1CON1_SMP_POSITION                    equ 0007h
SPI1CON1_SMP_SIZE                        equ 0001h
SPI1CON1_SMP_LENGTH                      equ 0001h
SPI1CON1_SMP_MASK                        equ 0080h
SPI1CON1_SPI1SDOP_POSN                   equ 0000h
SPI1CON1_SPI1SDOP_POSITION               equ 0000h
SPI1CON1_SPI1SDOP_SIZE                   equ 0001h
SPI1CON1_SPI1SDOP_LENGTH                 equ 0001h
SPI1CON1_SPI1SDOP_MASK                   equ 0001h
SPI1CON1_SPI1SDIP_POSN                   equ 0001h
SPI1CON1_SPI1SDIP_POSITION               equ 0001h
SPI1CON1_SPI1SDIP_SIZE                   equ 0001h
SPI1CON1_SPI1SDIP_LENGTH                 equ 0001h
SPI1CON1_SPI1SDIP_MASK                   equ 0002h
SPI1CON1_SPI1SSP_POSN                    equ 0002h
SPI1CON1_SPI1SSP_POSITION                equ 0002h
SPI1CON1_SPI1SSP_SIZE                    equ 0001h
SPI1CON1_SPI1SSP_LENGTH                  equ 0001h
SPI1CON1_SPI1SSP_MASK                    equ 0004h
SPI1CON1_SPI1FST_POSN                    equ 0004h
SPI1CON1_SPI1FST_POSITION                equ 0004h
SPI1CON1_SPI1FST_SIZE                    equ 0001h
SPI1CON1_SPI1FST_LENGTH                  equ 0001h
SPI1CON1_SPI1FST_MASK                    equ 0010h
SPI1CON1_SPI1CKP_POSN                    equ 0005h
SPI1CON1_SPI1CKP_POSITION                equ 0005h
SPI1CON1_SPI1CKP_SIZE                    equ 0001h
SPI1CON1_SPI1CKP_LENGTH                  equ 0001h
SPI1CON1_SPI1CKP_MASK                    equ 0020h
SPI1CON1_SPI1CKE_POSN                    equ 0006h
SPI1CON1_SPI1CKE_POSITION                equ 0006h
SPI1CON1_SPI1CKE_SIZE                    equ 0001h
SPI1CON1_SPI1CKE_LENGTH                  equ 0001h
SPI1CON1_SPI1CKE_MASK                    equ 0040h
SPI1CON1_SPI1SMP_POSN                    equ 0007h
SPI1CON1_SPI1SMP_POSITION                equ 0007h
SPI1CON1_SPI1SMP_SIZE                    equ 0001h
SPI1CON1_SPI1SMP_LENGTH                  equ 0001h
SPI1CON1_SPI1SMP_MASK                    equ 0080h

// Register: SPI1CON2
#define SPI1CON2 SPI1CON2
SPI1CON2                                 equ 01DDh
// bitfield definitions
SPI1CON2_RXR_POSN                        equ 0000h
SPI1CON2_RXR_POSITION                    equ 0000h
SPI1CON2_RXR_SIZE                        equ 0001h
SPI1CON2_RXR_LENGTH                      equ 0001h
SPI1CON2_RXR_MASK                        equ 0001h
SPI1CON2_TXR_POSN                        equ 0001h
SPI1CON2_TXR_POSITION                    equ 0001h
SPI1CON2_TXR_SIZE                        equ 0001h
SPI1CON2_TXR_LENGTH                      equ 0001h
SPI1CON2_TXR_MASK                        equ 0002h
SPI1CON2_SSET_POSN                       equ 0002h
SPI1CON2_SSET_POSITION                   equ 0002h
SPI1CON2_SSET_SIZE                       equ 0001h
SPI1CON2_SSET_LENGTH                     equ 0001h
SPI1CON2_SSET_MASK                       equ 0004h
SPI1CON2_SSFLT_POSN                      equ 0006h
SPI1CON2_SSFLT_POSITION                  equ 0006h
SPI1CON2_SSFLT_SIZE                      equ 0001h
SPI1CON2_SSFLT_LENGTH                    equ 0001h
SPI1CON2_SSFLT_MASK                      equ 0040h
SPI1CON2_BUSY_POSN                       equ 0007h
SPI1CON2_BUSY_POSITION                   equ 0007h
SPI1CON2_BUSY_SIZE                       equ 0001h
SPI1CON2_BUSY_LENGTH                     equ 0001h
SPI1CON2_BUSY_MASK                       equ 0080h
SPI1CON2_SPI1RXR_POSN                    equ 0000h
SPI1CON2_SPI1RXR_POSITION                equ 0000h
SPI1CON2_SPI1RXR_SIZE                    equ 0001h
SPI1CON2_SPI1RXR_LENGTH                  equ 0001h
SPI1CON2_SPI1RXR_MASK                    equ 0001h
SPI1CON2_SPI1TXR_POSN                    equ 0001h
SPI1CON2_SPI1TXR_POSITION                equ 0001h
SPI1CON2_SPI1TXR_SIZE                    equ 0001h
SPI1CON2_SPI1TXR_LENGTH                  equ 0001h
SPI1CON2_SPI1TXR_MASK                    equ 0002h
SPI1CON2_SPI1SSET_POSN                   equ 0002h
SPI1CON2_SPI1SSET_POSITION               equ 0002h
SPI1CON2_SPI1SSET_SIZE                   equ 0001h
SPI1CON2_SPI1SSET_LENGTH                 equ 0001h
SPI1CON2_SPI1SSET_MASK                   equ 0004h
SPI1CON2_SPI1SSFLT_POSN                  equ 0006h
SPI1CON2_SPI1SSFLT_POSITION              equ 0006h
SPI1CON2_SPI1SSFLT_SIZE                  equ 0001h
SPI1CON2_SPI1SSFLT_LENGTH                equ 0001h
SPI1CON2_SPI1SSFLT_MASK                  equ 0040h
SPI1CON2_SPI1BUSY_POSN                   equ 0007h
SPI1CON2_SPI1BUSY_POSITION               equ 0007h
SPI1CON2_SPI1BUSY_SIZE                   equ 0001h
SPI1CON2_SPI1BUSY_LENGTH                 equ 0001h
SPI1CON2_SPI1BUSY_MASK                   equ 0080h

