garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f04q20.inc
// Register: I2C1STAT1
#define I2C1STAT1 I2C1STAT1
I2C1STAT1                                equ 01E5h
// bitfield definitions
I2C1STAT1_RXBF_POSN                      equ 0000h
I2C1STAT1_RXBF_POSITION                  equ 0000h
I2C1STAT1_RXBF_SIZE                      equ 0001h
I2C1STAT1_RXBF_LENGTH                    equ 0001h
I2C1STAT1_RXBF_MASK                      equ 0001h
I2C1STAT1_CLRBF_POSN                     equ 0002h
I2C1STAT1_CLRBF_POSITION                 equ 0002h
I2C1STAT1_CLRBF_SIZE                     equ 0001h
I2C1STAT1_CLRBF_LENGTH                   equ 0001h
I2C1STAT1_CLRBF_MASK                     equ 0004h
I2C1STAT1_RXRE_POSN                      equ 0003h
I2C1STAT1_RXRE_POSITION                  equ 0003h
I2C1STAT1_RXRE_SIZE                      equ 0001h
I2C1STAT1_RXRE_LENGTH                    equ 0001h
I2C1STAT1_RXRE_MASK                      equ 0008h
I2C1STAT1_TXBE_POSN                      equ 0005h
I2C1STAT1_TXBE_POSITION                  equ 0005h
I2C1STAT1_TXBE_SIZE                      equ 0001h
I2C1STAT1_TXBE_LENGTH                    equ 0001h
I2C1STAT1_TXBE_MASK                      equ 0020h
I2C1STAT1_TXWE_POSN                      equ 0007h
I2C1STAT1_TXWE_POSITION                  equ 0007h
I2C1STAT1_TXWE_SIZE                      equ 0001h
I2C1STAT1_TXWE_LENGTH                    equ 0001h
I2C1STAT1_TXWE_MASK                      equ 0080h

// Register: I2C1CON0
#define I2C1CON0 I2C1CON0
I2C1CON0                                 equ 01E6h
// bitfield definitions
I2C1CON0_MODE_POSN                       equ 0000h
I2C1CON0_MODE_POSITION                   equ 0000h
I2C1CON0_MODE_SIZE                       equ 0003h
I2C1CON0_MODE_LENGTH                     equ 0003h
I2C1CON0_MODE_MASK                       equ 0007h
I2C1CON0_MDR_POSN                        equ 0003h
I2C1CON0_MDR_POSITION                    equ 0003h
I2C1CON0_MDR_SIZE                        equ 0001h
I2C1CON0_MDR_LENGTH                      equ 0001h
I2C1CON0_MDR_MASK                        equ 0008h
I2C1CON0_CSTR_POSN                       equ 0004h
I2C1CON0_CSTR_POSITION                   equ 0004h
I2C1CON0_CSTR_SIZE                       equ 0001h
I2C1CON0_CSTR_LENGTH                     equ 0001h
I2C1CON0_CSTR_MASK                       equ 0010h
I2C1CON0_S_POSN                          equ 0005h
I2C1CON0_S_POSITION                      equ 0005h
I2C1CON0_S_SIZE                          equ 0001h
I2C1CON0_S_LENGTH                        equ 0001h
I2C1CON0_S_MASK                          equ 0020h
I2C1CON0_RSEN_POSN                       equ 0006h
I2C1CON0_RSEN_POSITION                   equ 0006h
I2C1CON0_RSEN_SIZE                       equ 0001h
I2C1CON0_RSEN_LENGTH                     equ 0001h
I2C1CON0_RSEN_MASK                       equ 0040h
I2C1CON0_EN_POSN                         equ 0007h
I2C1CON0_EN_POSITION                     equ 0007h
I2C1CON0_EN_SIZE                         equ 0001h
I2C1CON0_EN_LENGTH                       equ 0001h
I2C1CON0_EN_MASK                         equ 0080h
I2C1CON0_MODE0_POSN                      equ 0000h
I2C1CON0_MODE0_POSITION                  equ 0000h
I2C1CON0_MODE0_SIZE                      equ 0001h
I2C1CON0_MODE0_LENGTH                    equ 0001h
I2C1CON0_MODE0_MASK                      equ 0001h
I2C1CON0_MODE1_POSN                      equ 0001h
I2C1CON0_MODE1_POSITION                  equ 0001h
I2C1CON0_MODE1_SIZE                      equ 0001h
I2C1CON0_MODE1_LENGTH                    equ 0001h
I2C1CON0_MODE1_MASK                      equ 0002h
I2C1CON0_MODE2_POSN                      equ 0002h
I2C1CON0_MODE2_POSITION                  equ 0002h
I2C1CON0_MODE2_SIZE                      equ 0001h
I2C1CON0_MODE2_LENGTH                    equ 0001h
I2C1CON0_MODE2_MASK                      equ 0004h
I2C1CON0_I2CEN_POSN                      equ 0007h
I2C1CON0_I2CEN_POSITION                  equ 0007h
I2C1CON0_I2CEN_SIZE                      equ 0001h
I2C1CON0_I2CEN_LENGTH                    equ 0001h
I2C1CON0_I2CEN_MASK                      equ 0080h

// Register: I2C1CON1
#define I2C1CON1 I2C1CON1
I2C1CON1                                 equ 01E7h
// bitfield definitions
I2C1CON1_CSD_POSN                        equ 0000h
I2C1CON1_CSD_POSITION                    equ 0000h
I2C1CON1_CSD_SIZE                        equ 0001h
I2C1CON1_CSD_LENGTH                      equ 0001h
I2C1CON1_CSD_MASK                        equ 0001h
I2C1CON1_TXU_POSN                        equ 0001h
I2C1CON1_TXU_POSITION                    equ 0001h
I2C1CON1_TXU_SIZE                        equ 0001h
I2C1CON1_TXU_LENGTH                      equ 0001h
I2C1CON1_TXU_MASK                        equ 0002h
I2C1CON1_RXO_POSN                        equ 0002h
I2C1CON1_RXO_POSITION                    equ 0002h
I2C1CON1_RXO_SIZE                        equ 0001h
I2C1CON1_RXO_LENGTH                      equ 0001h
I2C1CON1_RXO_MASK                        equ 0004h
I2C1CON1_P_POSN                          equ 0003h
I2C1CON1_P_POSITION                      equ 0003h
I2C1CON1_P_SIZE                          equ 0001h
I2C1CON1_P_LENGTH                        equ 0001h
I2C1CON1_P_MASK                          equ 0008h
I2C1CON1_ACKT_POSN                       equ 0004h
I2C1CON1_ACKT_POSITION                   equ 0004h
I2C1CON1_ACKT_SIZE                       equ 0001h
I2C1CON1_ACKT_LENGTH                     equ 0001h
I2C1CON1_ACKT_MASK                       equ 0010h
I2C1CON1_ACKSTAT_POSN                    equ 0005h
I2C1CON1_ACKSTAT_POSITION                equ 0005h
I2C1CON1_ACKSTAT_SIZE                    equ 0001h
I2C1CON1_ACKSTAT_LENGTH                  equ 0001h
I2C1CON1_ACKSTAT_MASK                    equ 0020h
I2C1CON1_ACKDT_POSN                      equ 0006h
I2C1CON1_ACKDT_POSITION                  equ 0006h
I2C1CON1_ACKDT_SIZE                      equ 0001h
I2C1CON1_ACKDT_LENGTH                    equ 0001h
I2C1CON1_ACKDT_MASK                      equ 0040h
I2C1CON1_ACKCNT_POSN                     equ 0007h
I2C1CON1_ACKCNT_POSITION                 equ 0007h
I2C1CON1_ACKCNT_SIZE                     equ 0001h
I2C1CON1_ACKCNT_LENGTH                   equ 0001h
I2C1CON1_ACKCNT_MASK                     equ 0080h

