garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f04q20.inc
// Register: I2C1ADB1
#define I2C1ADB1 I2C1ADB1
I2C1ADB1                                 equ 01F2h
// bitfield definitions
I2C1ADB1_ADB_POSN                        equ 0000h
I2C1ADB1_ADB_POSITION                    equ 0000h
I2C1ADB1_ADB_SIZE                        equ 0008h
I2C1ADB1_ADB_LENGTH                      equ 0008h
I2C1ADB1_ADB_MASK                        equ 00FFh

// Register: I2C1ADR0
#define I2C1ADR0 I2C1ADR0
I2C1ADR0                                 equ 01F3h
// bitfield definitions
I2C1ADR0_ADR_POSN                        equ 0000h
I2C1ADR0_ADR_POSITION                    equ 0000h
I2C1ADR0_ADR_SIZE                        equ 0008h
I2C1ADR0_ADR_LENGTH                      equ 0008h
I2C1ADR0_ADR_MASK                        equ 00FFh

// Register: I2C1ADR1
#define I2C1ADR1 I2C1ADR1
I2C1ADR1                                 equ 01F4h
// bitfield definitions
I2C1ADR1_ADR_POSN                        equ 0001h
I2C1ADR1_ADR_POSITION                    equ 0001h
I2C1ADR1_ADR_SIZE                        equ 0007h
I2C1ADR1_ADR_LENGTH                      equ 0007h
I2C1ADR1_ADR_MASK                        equ 00FEh

// Register: I2C1ADR2
#define I2C1ADR2 I2C1ADR2
I2C1ADR2                                 equ 01F5h
// bitfield definitions
I2C1ADR2_ADR_POSN                        equ 0000h
I2C1ADR2_ADR_POSITION                    equ 0000h
I2C1ADR2_ADR_SIZE                        equ 0008h
I2C1ADR2_ADR_LENGTH                      equ 0008h
I2C1ADR2_ADR_MASK                        equ 00FFh

// Register: I2C1ADR3
#define I2C1ADR3 I2C1ADR3
I2C1ADR3                                 equ 01F6h
// bitfield definitions
I2C1ADR3_ADR_POSN                        equ 0001h
I2C1ADR3_ADR_POSITION                    equ 0001h
I2C1ADR3_ADR_SIZE                        equ 0007h
I2C1ADR3_ADR_LENGTH                      equ 0007h
I2C1ADR3_ADR_MASK                        equ 00FEh

// Register: I2C1BTO
#define I2C1BTO I2C1BTO
I2C1BTO                                  equ 01F7h
// bitfield definitions
I2C1BTO_TOTIME_POSN                      equ 0000h
I2C1BTO_TOTIME_POSITION                  equ 0000h
I2C1BTO_TOTIME_SIZE                      equ 0006h
I2C1BTO_TOTIME_LENGTH                    equ 0006h
I2C1BTO_TOTIME_MASK                      equ 003Fh
I2C1BTO_TOBY32_POSN                      equ 0006h
I2C1BTO_TOBY32_POSITION                  equ 0006h
I2C1BTO_TOBY32_SIZE                      equ 0001h
I2C1BTO_TOBY32_LENGTH                    equ 0001h
I2C1BTO_TOBY32_MASK                      equ 0040h
I2C1BTO_TOREC_POSN                       equ 0007h
I2C1BTO_TOREC_POSITION                   equ 0007h
I2C1BTO_TOREC_SIZE                       equ 0001h
I2C1BTO_TOREC_LENGTH                     equ 0001h
I2C1BTO_TOREC_MASK                       equ 0080h
I2C1BTO_TOTIME0_POSN                     equ 0000h
I2C1BTO_TOTIME0_POSITION                 equ 0000h
I2C1BTO_TOTIME0_SIZE                     equ 0001h
I2C1BTO_TOTIME0_LENGTH                   equ 0001h
I2C1BTO_TOTIME0_MASK                     equ 0001h
I2C1BTO_TOTIME1_POSN                     equ 0001h
I2C1BTO_TOTIME1_POSITION                 equ 0001h
I2C1BTO_TOTIME1_SIZE                     equ 0001h
I2C1BTO_TOTIME1_LENGTH                   equ 0001h
I2C1BTO_TOTIME1_MASK                     equ 0002h
I2C1BTO_TOTIME2_POSN                     equ 0002h
I2C1BTO_TOTIME2_POSITION                 equ 0002h
I2C1BTO_TOTIME2_SIZE                     equ 0001h
I2C1BTO_TOTIME2_LENGTH                   equ 0001h
I2C1BTO_TOTIME2_MASK                     equ 0004h
I2C1BTO_TOTIME3_POSN                     equ 0003h
I2C1BTO_TOTIME3_POSITION                 equ 0003h
I2C1BTO_TOTIME3_SIZE                     equ 0001h
I2C1BTO_TOTIME3_LENGTH                   equ 0001h
I2C1BTO_TOTIME3_MASK                     equ 0008h
I2C1BTO_TOTIME4_POSN                     equ 0004h
I2C1BTO_TOTIME4_POSITION                 equ 0004h
I2C1BTO_TOTIME4_SIZE                     equ 0001h
I2C1BTO_TOTIME4_LENGTH                   equ 0001h
I2C1BTO_TOTIME4_MASK                     equ 0010h
I2C1BTO_TOTIME5_POSN                     equ 0005h
I2C1BTO_TOTIME5_POSITION                 equ 0005h
I2C1BTO_TOTIME5_SIZE                     equ 0001h
I2C1BTO_TOTIME5_LENGTH                   equ 0001h
I2C1BTO_TOTIME5_MASK                     equ 0020h

// Register: I2C1BAUD
#define I2C1BAUD I2C1BAUD
I2C1BAUD                                 equ 01F8h
// bitfield definitions
I2C1BAUD_BAUD_POSN                       equ 0000h
I2C1BAUD_BAUD_POSITION                   equ 0000h
I2C1BAUD_BAUD_SIZE                       equ 0008h
I2C1BAUD_BAUD_LENGTH                     equ 0008h
I2C1BAUD_BAUD_MASK                       equ 00FFh

// Register: I2C1CLK
#define I2C1CLK I2C1CLK
I2C1CLK                                  equ 01F9h
// bitfield definitions
I2C1CLK_CLK_POSN                         equ 0000h
I2C1CLK_CLK_POSITION                     equ 0000h
I2C1CLK_CLK_SIZE                         equ 0008h
I2C1CLK_CLK_LENGTH                       equ 0008h
I2C1CLK_CLK_MASK                         equ 00FFh
I2C1CLK_I2CCLK_POSN                      equ 0000h
I2C1CLK_I2CCLK_POSITION                  equ 0000h
I2C1CLK_I2CCLK_SIZE                      equ 0008h
I2C1CLK_I2CCLK_LENGTH                    equ 0008h
I2C1CLK_I2CCLK_MASK                      equ 00FFh
I2C1CLK_CLK0_POSN                        equ 0000h
I2C1CLK_CLK0_POSITION                    equ 0000h
I2C1CLK_CLK0_SIZE                        equ 0001h
I2C1CLK_CLK0_LENGTH                      equ 0001h
I2C1CLK_CLK0_MASK                        equ 0001h
I2C1CLK_CLK1_POSN                        equ 0001h
I2C1CLK_CLK1_POSITION                    equ 0001h
I2C1CLK_CLK1_SIZE                        equ 0001h
I2C1CLK_CLK1_LENGTH                      equ 0001h
I2C1CLK_CLK1_MASK                        equ 0002h
I2C1CLK_CLK2_POSN                        equ 0002h
I2C1CLK_CLK2_POSITION                    equ 0002h
I2C1CLK_CLK2_SIZE                        equ 0001h
I2C1CLK_CLK2_LENGTH                      equ 0001h
I2C1CLK_CLK2_MASK                        equ 0004h
I2C1CLK_CLK3_POSN                        equ 0003h
I2C1CLK_CLK3_POSITION                    equ 0003h
I2C1CLK_CLK3_SIZE                        equ 0001h
I2C1CLK_CLK3_LENGTH                      equ 0001h
I2C1CLK_CLK3_MASK                        equ 0008h
I2C1CLK_I2CCLK0_POSN                     equ 0000h
I2C1CLK_I2CCLK0_POSITION                 equ 0000h
I2C1CLK_I2CCLK0_SIZE                     equ 0001h
I2C1CLK_I2CCLK0_LENGTH                   equ 0001h
I2C1CLK_I2CCLK0_MASK                     equ 0001h
I2C1CLK_I2CCLK1_POSN                     equ 0001h
I2C1CLK_I2CCLK1_POSITION                 equ 0001h
I2C1CLK_I2CCLK1_SIZE                     equ 0001h
I2C1CLK_I2CCLK1_LENGTH                   equ 0001h
I2C1CLK_I2CCLK1_MASK                     equ 0002h
I2C1CLK_I2CCLK2_POSN                     equ 0002h
I2C1CLK_I2CCLK2_POSITION                 equ 0002h
I2C1CLK_I2CCLK2_SIZE                     equ 0001h
I2C1CLK_I2CCLK2_LENGTH                   equ 0001h
I2C1CLK_I2CCLK2_MASK                     equ 0004h
I2C1CLK_I2CCLK3_POSN                     equ 0003h
I2C1CLK_I2CCLK3_POSITION                 equ 0003h
I2C1CLK_I2CCLK3_SIZE                     equ 0001h
I2C1CLK_I2CCLK3_LENGTH                   equ 0001h
I2C1CLK_I2CCLK3_MASK                     equ 0008h

// Register: I2C1BTOC
#define I2C1BTOC I2C1BTOC
I2C1BTOC                                 equ 01FAh
// bitfield definitions
I2C1BTOC_BTOC_POSN                       equ 0000h
I2C1BTOC_BTOC_POSITION                   equ 0000h
I2C1BTOC_BTOC_SIZE                       equ 0008h
I2C1BTOC_BTOC_LENGTH                     equ 0008h
I2C1BTOC_BTOC_MASK                       equ 00FFh
I2C1BTOC_I2CBTOC_POSN                    equ 0000h
I2C1BTOC_I2CBTOC_POSITION                equ 0000h
I2C1BTOC_I2CBTOC_SIZE                    equ 0008h
I2C1BTOC_I2CBTOC_LENGTH                  equ 0008h
I2C1BTOC_I2CBTOC_MASK                    equ 00FFh
I2C1BTOC_BTOC0_POSN                      equ 0000h
I2C1BTOC_BTOC0_POSITION                  equ 0000h
I2C1BTOC_BTOC0_SIZE                      equ 0001h
I2C1BTOC_BTOC0_LENGTH                    equ 0001h
I2C1BTOC_BTOC0_MASK                      equ 0001h
I2C1BTOC_BTOC1_POSN                      equ 0001h
I2C1BTOC_BTOC1_POSITION                  equ 0001h
I2C1BTOC_BTOC1_SIZE                      equ 0001h
I2C1BTOC_BTOC1_LENGTH                    equ 0001h
I2C1BTOC_BTOC1_MASK                      equ 0002h
I2C1BTOC_BTOC2_POSN                      equ 0002h
I2C1BTOC_BTOC2_POSITION                  equ 0002h
I2C1BTOC_BTOC2_SIZE                      equ 0001h
I2C1BTOC_BTOC2_LENGTH                    equ 0001h
I2C1BTOC_BTOC2_MASK                      equ 0004h
I2C1BTOC_I2CBTOC0_POSN                   equ 0000h
I2C1BTOC_I2CBTOC0_POSITION               equ 0000h
I2C1BTOC_I2CBTOC0_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC0_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC0_MASK                   equ 0001h
I2C1BTOC_I2CBTOC1_POSN                   equ 0001h
I2C1BTOC_I2CBTOC1_POSITION               equ 0001h
I2C1BTOC_I2CBTOC1_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC1_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC1_MASK                   equ 0002h
I2C1BTOC_I2CBTOC2_POSN                   equ 0002h
I2C1BTOC_I2CBTOC2_POSITION               equ 0002h
I2C1BTOC_I2CBTOC2_SIZE                   equ 0001h
I2C1BTOC_I2CBTOC2_LENGTH                 equ 0001h
I2C1BTOC_I2CBTOC2_MASK                   equ 0004h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 0201h
// bitfield definitions
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_RDY_POSN                          equ 0006h
FVRCON_RDY_POSITION                      equ 0006h
FVRCON_RDY_SIZE                          equ 0001h
FVRCON_RDY_LENGTH                        equ 0001h
FVRCON_RDY_MASK                          equ 0040h
FVRCON_EN_POSN                           equ 0007h
FVRCON_EN_POSITION                       equ 0007h
FVRCON_EN_SIZE                           equ 0001h
FVRCON_EN_LENGTH                         equ 0001h
FVRCON_EN_MASK                           equ 0080h
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h

// Register: HLVDCON0
#define HLVDCON0 HLVDCON0
HLVDCON0                                 equ 0202h
// bitfield definitions
HLVDCON0_INTL_POSN                       equ 0000h
HLVDCON0_INTL_POSITION                   equ 0000h
HLVDCON0_INTL_SIZE                       equ 0001h
HLVDCON0_INTL_LENGTH                     equ 0001h
HLVDCON0_INTL_MASK                       equ 0001h
HLVDCON0_INTH_POSN                       equ 0001h
HLVDCON0_INTH_POSITION                   equ 0001h
HLVDCON0_INTH_SIZE                       equ 0001h
HLVDCON0_INTH_LENGTH                     equ 0001h
HLVDCON0_INTH_MASK                       equ 0002h
HLVDCON0_RDY_POSN                        equ 0004h
HLVDCON0_RDY_POSITION                    equ 0004h
HLVDCON0_RDY_SIZE                        equ 0001h
HLVDCON0_RDY_LENGTH                      equ 0001h
HLVDCON0_RDY_MASK                        equ 0010h
HLVDCON0_OUT_POSN                        equ 0005h
HLVDCON0_OUT_POSITION                    equ 0005h
HLVDCON0_OUT_SIZE                        equ 0001h
HLVDCON0_OUT_LENGTH                      equ 0001h
HLVDCON0_OUT_MASK                        equ 0020h
HLVDCON0_EN_POSN                         equ 0007h
HLVDCON0_EN_POSITION                     equ 0007h
HLVDCON0_EN_SIZE                         equ 0001h
HLVDCON0_EN_LENGTH                       equ 0001h
HLVDCON0_EN_MASK                         equ 0080h
HLVDCON0_HLVDINTL_POSN                   equ 0000h
HLVDCON0_HLVDINTL_POSITION               equ 0000h
HLVDCON0_HLVDINTL_SIZE                   equ 0001h
HLVDCON0_HLVDINTL_LENGTH                 equ 0001h
HLVDCON0_HLVDINTL_MASK                   equ 0001h
HLVDCON0_HLVDINTH_POSN                   equ 0001h
HLVDCON0_HLVDINTH_POSITION               equ 0001h
HLVDCON0_HLVDINTH_SIZE                   equ 0001h
HLVDCON0_HLVDINTH_LENGTH                 equ 0001h
HLVDCON0_HLVDINTH_MASK                   equ 0002h
HLVDCON0_HLVDRDY_POSN                    equ 0004h
HLVDCON0_HLVDRDY_POSITION                equ 0004h
HLVDCON0_HLVDRDY_SIZE                    equ 0001h
HLVDCON0_HLVDRDY_LENGTH                  equ 0001h
HLVDCON0_HLVDRDY_MASK                    equ 0010h
HLVDCON0_HLVDOUT_POSN                    equ 0005h
HLVDCON0_HLVDOUT_POSITION                equ 0005h
HLVDCON0_HLVDOUT_SIZE                    equ 0001h
HLVDCON0_HLVDOUT_LENGTH                  equ 0001h
HLVDCON0_HLVDOUT_MASK                    equ 0020h
HLVDCON0_HLVDEN_POSN                     equ 0007h
HLVDCON0_HLVDEN_POSITION                 equ 0007h
HLVDCON0_HLVDEN_SIZE                     equ 0001h
HLVDCON0_HLVDEN_LENGTH                   equ 0001h
HLVDCON0_HLVDEN_MASK                     equ 0080h

// Register: HLVDCON1
#define HLVDCON1 HLVDCON1
HLVDCON1                                 equ 0203h
// bitfield definitions
HLVDCON1_SEL_POSN                        equ 0000h
HLVDCON1_SEL_POSITION                    equ 0000h
HLVDCON1_SEL_SIZE                        equ 0004h
HLVDCON1_SEL_LENGTH                      equ 0004h
HLVDCON1_SEL_MASK                        equ 000Fh
HLVDCON1_SEL0_POSN                       equ 0000h
HLVDCON1_SEL0_POSITION                   equ 0000h
HLVDCON1_SEL0_SIZE                       equ 0001h
HLVDCON1_SEL0_LENGTH                     equ 0001h
HLVDCON1_SEL0_MASK                       equ 0001h
HLVDCON1_SEL1_POSN                       equ 0001h
HLVDCON1_SEL1_POSITION                   equ 0001h
HLVDCON1_SEL1_SIZE                       equ 0001h
HLVDCON1_SEL1_LENGTH                     equ 0001h
HLVDCON1_SEL1_MASK                       equ 0002h
HLVDCON1_SEL2_POSN                       equ 0002h
HLVDCON1_SEL2_POSITION                   equ 0002h
HLVDCON1_SEL2_SIZE                       equ 0001h
HLVDCON1_SEL2_LENGTH                     equ 0001h
HLVDCON1_SEL2_MASK                       equ 0004h
HLVDCON1_SEL3_POSN                       equ 0003h
HLVDCON1_SEL3_POSITION                   equ 0003h
HLVDCON1_SEL3_SIZE                       equ 0001h
HLVDCON1_SEL3_LENGTH                     equ 0001h
HLVDCON1_SEL3_MASK                       equ 0008h
HLVDCON1_HLVDSEL0_POSN                   equ 0000h
HLVDCON1_HLVDSEL0_POSITION               equ 0000h
HLVDCON1_HLVDSEL0_SIZE                   equ 0001h
HLVDCON1_HLVDSEL0_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL0_MASK                   equ 0001h
HLVDCON1_HLVDSEL1_POSN                   equ 0001h
HLVDCON1_HLVDSEL1_POSITION               equ 0001h
HLVDCON1_HLVDSEL1_SIZE                   equ 0001h
HLVDCON1_HLVDSEL1_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL1_MASK                   equ 0002h
HLVDCON1_HLVDSEL2_POSN                   equ 0002h
HLVDCON1_HLVDSEL2_POSITION               equ 0002h
HLVDCON1_HLVDSEL2_SIZE                   equ 0001h
HLVDCON1_HLVDSEL2_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL2_MASK                   equ 0004h
HLVDCON1_HLVDSEL3_POSN                   equ 0003h
HLVDCON1_HLVDSEL3_POSITION               equ 0003h
HLVDCON1_HLVDSEL3_SIZE                   equ 0001h
HLVDCON1_HLVDSEL3_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL3_MASK                   equ 0008h

// Register: ADLTH
#define ADLTH ADLTH
ADLTH                                    equ 0215h

// Register: ADLTHL
#define ADLTHL ADLTHL
ADLTHL                                   equ 0215h
// bitfield definitions
ADLTHL_LTH_POSN                          equ 0000h
ADLTHL_LTH_POSITION                      equ 0000h
ADLTHL_LTH_SIZE                          equ 0008h
ADLTHL_LTH_LENGTH                        equ 0008h
ADLTHL_LTH_MASK                          equ 00FFh
ADLTHL_ADLTH0_POSN                       equ 0000h
ADLTHL_ADLTH0_POSITION                   equ 0000h
ADLTHL_ADLTH0_SIZE                       equ 0001h
ADLTHL_ADLTH0_LENGTH                     equ 0001h
ADLTHL_ADLTH0_MASK                       equ 0001h
ADLTHL_ADLTH1_POSN                       equ 0001h
ADLTHL_ADLTH1_POSITION                   equ 0001h
ADLTHL_ADLTH1_SIZE                       equ 0001h
ADLTHL_ADLTH1_LENGTH                     equ 0001h
ADLTHL_ADLTH1_MASK                       equ 0002h
ADLTHL_ADLTH2_POSN                       equ 0002h
ADLTHL_ADLTH2_POSITION                   equ 0002h
ADLTHL_ADLTH2_SIZE                       equ 0001h
ADLTHL_ADLTH2_LENGTH                     equ 0001h
ADLTHL_ADLTH2_MASK                       equ 0004h
ADLTHL_ADLTH3_POSN                       equ 0003h
ADLTHL_ADLTH3_POSITION                   equ 0003h
ADLTHL_ADLTH3_SIZE                       equ 0001h
ADLTHL_ADLTH3_LENGTH                     equ 0001h
ADLTHL_ADLTH3_MASK                       equ 0008h
ADLTHL_ADLTH4_POSN                       equ 0004h
ADLTHL_ADLTH4_POSITION                   equ 0004h
ADLTHL_ADLTH4_SIZE                       equ 0001h
ADLTHL_ADLTH4_LENGTH                     equ 0001h
ADLTHL_ADLTH4_MASK                       equ 0010h
ADLTHL_ADLTH5_POSN                       equ 0005h
ADLTHL_ADLTH5_POSITION                   equ 0005h
ADLTHL_ADLTH5_SIZE                       equ 0001h
ADLTHL_ADLTH5_LENGTH                     equ 0001h
ADLTHL_ADLTH5_MASK                       equ 0020h
ADLTHL_ADLTH6_POSN                       equ 0006h
ADLTHL_ADLTH6_POSITION                   equ 0006h
ADLTHL_ADLTH6_SIZE                       equ 0001h
ADLTHL_ADLTH6_LENGTH                     equ 0001h
ADLTHL_ADLTH6_MASK                       equ 0040h
ADLTHL_ADLTH7_POSN                       equ 0007h
ADLTHL_ADLTH7_POSITION                   equ 0007h
ADLTHL_ADLTH7_SIZE                       equ 0001h
ADLTHL_ADLTH7_LENGTH                     equ 0001h
ADLTHL_ADLTH7_MASK                       equ 0080h
ADLTHL_ADLTH_POSN                        equ 0000h
ADLTHL_ADLTH_POSITION                    equ 0000h
ADLTHL_ADLTH_SIZE                        equ 0008h
ADLTHL_ADLTH_LENGTH                      equ 0008h
ADLTHL_ADLTH_MASK                        equ 00FFh
ADLTHL_LTH0_POSN                         equ 0000h
ADLTHL_LTH0_POSITION                     equ 0000h
ADLTHL_LTH0_SIZE                         equ 0001h
ADLTHL_LTH0_LENGTH                       equ 0001h
ADLTHL_LTH0_MASK                         equ 0001h
ADLTHL_LTH1_POSN                         equ 0001h
ADLTHL_LTH1_POSITION                     equ 0001h
ADLTHL_LTH1_SIZE                         equ 0001h
ADLTHL_LTH1_LENGTH                       equ 0001h
ADLTHL_LTH1_MASK                         equ 0002h
ADLTHL_LTH2_POSN                         equ 0002h
ADLTHL_LTH2_POSITION                     equ 0002h
ADLTHL_LTH2_SIZE                         equ 0001h
ADLTHL_LTH2_LENGTH                       equ 0001h
ADLTHL_LTH2_MASK                         equ 0004h
ADLTHL_LTH3_POSN                         equ 0003h
ADLTHL_LTH3_POSITION                     equ 0003h
ADLTHL_LTH3_SIZE                         equ 0001h
ADLTHL_LTH3_LENGTH                       equ 0001h
ADLTHL_LTH3_MASK                         equ 0008h
ADLTHL_LTH4_POSN                         equ 0004h
ADLTHL_LTH4_POSITION                     equ 0004h
ADLTHL_LTH4_SIZE                         equ 0001h
ADLTHL_LTH4_LENGTH                       equ 0001h
ADLTHL_LTH4_MASK                         equ 0010h
ADLTHL_LTH5_POSN                         equ 0005h
ADLTHL_LTH5_POSITION                     equ 0005h
ADLTHL_LTH5_SIZE                         equ 0001h
ADLTHL_LTH5_LENGTH                       equ 0001h
ADLTHL_LTH5_MASK                         equ 0020h
ADLTHL_LTH6_POSN                         equ 0006h
ADLTHL_LTH6_POSITION                     equ 0006h
ADLTHL_LTH6_SIZE                         equ 0001h
ADLTHL_LTH6_LENGTH                       equ 0001h
ADLTHL_LTH6_MASK                         equ 0040h
ADLTHL_LTH7_POSN                         equ 0007h
ADLTHL_LTH7_POSITION                     equ 0007h
ADLTHL_LTH7_SIZE                         equ 0001h
ADLTHL_LTH7_LENGTH                       equ 0001h
ADLTHL_LTH7_MASK                         equ 0080h

