garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f04q20.inc
#define INTP                             BANKMASK(CLCnCON), 4, b
#define INTPEND1                         BANKMASK(I3C1DSTAT0), 1, b
#define INTPEND2                         BANKMASK(I3C1DSTAT0), 2, b
#define INTPEND3                         BANKMASK(I3C1DSTAT0), 3, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCIE                            BANKMASK(PIE3), 4, a
#define IOCIF                            BANKMASK(PIR3), 4, a
#define IOCIP                            BANKMASK(IPR3), 4, a
#define IOCMD                            BANKMASK(PMD1), 2, b
#define IOCSRIE                          BANKMASK(PIE5), 7, a
#define IOCSRIF                          BANKMASK(PIR5), 7, a
#define IOCSRIP                          BANKMASK(IPR5), 7, a
#define IOCWF0                           BANKMASK(IOCWF), 0, b
#define IOCWF1                           BANKMASK(IOCWF), 1, b
#define IOCWF2                           BANKMASK(IOCWF), 2, b
#define IOCWF3                           BANKMASK(IOCWF), 3, b
#define IOCWF4                           BANKMASK(IOCWF), 4, b
#define IOCWF5                           BANKMASK(IOCWF), 5, b
#define IOCWF6                           BANKMASK(IOCWF), 6, b
#define IOCWF7                           BANKMASK(IOCWF), 7, b
#define IOCWN0                           BANKMASK(IOCWN), 0, b
#define IOCWN1                           BANKMASK(IOCWN), 1, b
#define IOCWN2                           BANKMASK(IOCWN), 2, b
#define IOCWN3                           BANKMASK(IOCWN), 3, b
#define IOCWN4                           BANKMASK(IOCWN), 4, b
#define IOCWN5                           BANKMASK(IOCWN), 5, b
#define IOCWN6                           BANKMASK(IOCWN), 6, b
#define IOCWN7                           BANKMASK(IOCWN), 7, b
#define IOCWP0                           BANKMASK(IOCWP), 0, b
#define IOCWP1                           BANKMASK(IOCWP), 1, b
#define IOCWP2                           BANKMASK(IOCWP), 2, b
#define IOCWP3                           BANKMASK(IOCWP), 3, b
#define IOCWP4                           BANKMASK(IOCWP), 4, b
#define IOCWP5                           BANKMASK(IOCWP), 5, b
#define IOCWP6                           BANKMASK(IOCWP), 6, b
#define IOCWP7                           BANKMASK(IOCWP), 7, b
#define ISM0                             BANKMASK(CWG1ISM), 0, b
#define ISM1                             BANKMASK(CWG1ISM), 1, b
#define ISM2                             BANKMASK(CWG1ISM), 2, b
#define ISM3                             BANKMASK(CWG1ISM), 3, b
#define ISM4                             BANKMASK(CWG1ISM), 4, b
#define ISRPR0                           BANKMASK(ISRPR), 0, b
#define ISRPR1                           BANKMASK(ISRPR), 1, b
#define ISRPR2                           BANKMASK(ISRPR), 2, b
#define IVTLOCKED                        BANKMASK(IVTLOCK), 0, a
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATW0                            BANKMASK(LATW), 0, a
#define LATW1                            BANKMASK(LATW), 1, a
#define LATW2                            BANKMASK(LATW), 2, a
#define LATW3                            BANKMASK(LATW), 3, a
#define LATW4                            BANKMASK(LATW), 4, a
#define LATW5                            BANKMASK(LATW), 5, a
#define LATW6                            BANKMASK(LATW), 6, a
#define LATW7                            BANKMASK(LATW), 7, a
#define LENDIAN                          BANKMASK(CRCCON0), 1, b
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LOCK                             BANKMASK(ACTCON), 3, b
#define LSAC0                            BANKMASK(CWG1AS0), 2, b
#define LSAC1                            BANKMASK(CWG1AS0), 3, b
#define LSBD0                            BANKMASK(CWG1AS0), 4, b
#define LSBD1                            BANKMASK(CWG1AS0), 5, b
#define LSBF                             BANKMASK(SPI1CON0), 2, b
#define LSCA1                            BANKMASK(CWG1AS0), 3, b
#define LSDB0                            BANKMASK(CWG1AS0), 4, b
#define LSDB1                            BANKMASK(CWG1AS0), 5, b
#define LTH0                             BANKMASK(ADLTHL), 0, b
#define LTH1                             BANKMASK(ADLTHL), 1, b
#define LTH10                            BANKMASK(ADLTHH), 2, b
#define LTH11                            BANKMASK(ADLTHH), 3, b
#define LTH12                            BANKMASK(ADLTHH), 4, b
#define LTH13                            BANKMASK(ADLTHH), 5, b
#define LTH14                            BANKMASK(ADLTHH), 6, b
#define LTH15                            BANKMASK(ADLTHH), 7, b
#define LTH2                             BANKMASK(ADLTHL), 2, b
#define LTH3                             BANKMASK(ADLTHL), 3, b
#define LTH4                             BANKMASK(ADLTHL), 4, b
#define LTH5                             BANKMASK(ADLTHL), 5, b
#define LTH6                             BANKMASK(ADLTHL), 6, b
#define LTH7                             BANKMASK(ADLTHL), 7, b
#define LTH8                             BANKMASK(ADLTHH), 0, b
#define LTH9                             BANKMASK(ADLTHH), 1, b
#define LTHR                             BANKMASK(ADSTAT), 5, b
#define MAINPR0                          BANKMASK(MAINPR), 0, b
#define MAINPR1                          BANKMASK(MAINPR), 1, b
#define MAINPR2                          BANKMASK(MAINPR), 2, b
#define MATH                             BANKMASK(ADSTAT), 4, b
#define MD0                              BANKMASK(ADCON2), 0, b
#define MD1                              BANKMASK(ADCON2), 1, b
#define MD16                             BANKMASK(T0CON0), 4, b
#define MD2                              BANKMASK(ADCON2), 2, b
#define MDR                              BANKMASK(I2C1CON0), 3, b
#define MEMV                             BANKMASK(PCON1), 1, a
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MMA                              BANKMASK(I2C1STAT0), 5, b
#define MPWM1EN                          BANKMASK(PWMEN), 0, b
#define MPWM1LD                          BANKMASK(PWMLOAD), 0, b
#define MPWM2EN                          BANKMASK(PWMEN), 1, b
#define MPWM2LD                          BANKMASK(PWMLOAD), 1, b
#define MREG                             BANKMASK(SCANCON0), 2, b
#define MRS0                             BANKMASK(I3C1MRS), 0, b
#define MRS1                             BANKMASK(I3C1MRS), 1, b
#define MRS2                             BANKMASK(I3C1MRS), 2, b
#define MRS3                             BANKMASK(I3C1MRS), 3, b
#define MRS4                             BANKMASK(I3C1MRS), 4, b
#define MRS5                             BANKMASK(I3C1MRS), 5, b
#define MRS6                             BANKMASK(I3C1MRS), 6, b
#define MRS7                             BANKMASK(I3C1MRS), 7, b
#define MST                              BANKMASK(SPI1CON0), 1, b
#define MWLOEIE                          BANKMASK(I3C1ERRIE1), 2, b
#define MWLOEIF                          BANKMASK(I3C1ERRIR1), 2, b
#define MWS0                             BANKMASK(I3C1MWS), 0, b
#define MWS1                             BANKMASK(I3C1MWS), 1, b
#define MWS2                             BANKMASK(I3C1MWS), 2, b
#define MWS3                             BANKMASK(I3C1MWS), 3, b
#define MWS4                             BANKMASK(I3C1MWS), 4, b
#define MWS5                             BANKMASK(I3C1MWS), 5, b
#define MWS6                             BANKMASK(I3C1MWS), 6, b
#define MWS7                             BANKMASK(I3C1MWS), 7, b
#define NACK1IE                          BANKMASK(I2C1ERR), 0, b
#define NACK1IF                          BANKMASK(I2C1ERR), 4, b
#define NACKIE                           BANKMASK(I2C1ERR), 0, b
#define NACKIF                           BANKMASK(I2C1ERR), 4, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_A                            BANKMASK(I2C1STAT0), 3, b
#define NOT_ADDRESS                      BANKMASK(I2C1STAT0), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_PORVDDIO2                    BANKMASK(PCON1), 3, a
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_SYNC                         BANKMASK(T1CON), 2, b
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_W                            BANKMASK(I2C1STAT0), 4, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE                        BANKMASK(I2C1STAT0), 4, b
#define NREF0                            BANKMASK(ADREF), 4, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMGO                            BANKMASK(NVMCON0), 0, b
#define NVMIE                            BANKMASK(PIE2), 4, a
#define NVMIF                            BANKMASK(PIR2), 4, a
#define NVMIP                            BANKMASK(IPR2), 4, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define OSFIE                            BANKMASK(PIE3), 1, a
#define OSFIF                            BANKMASK(PIR3), 1, a
#define OSFIP                            BANKMASK(IPR3), 1, a
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PCSC                             BANKMASK(ADCON1), 1, b
#define PERR                             BANKMASK(I3C1DSTAT0), 5, b
#define PID0                             BANKMASK(I3C1PID0), 0, b
#define PID1                             BANKMASK(I3C1PID0), 1, b
#define PID10                            BANKMASK(I3C1PID1), 2, b
#define PID11                            BANKMASK(I3C1PID1), 3, b
#define PID12                            BANKMASK(I3C1PID1), 4, b
#define PID13                            BANKMASK(I3C1PID1), 5, b
#define PID14                            BANKMASK(I3C1PID1), 6, b
#define PID15                            BANKMASK(I3C1PID1), 7, b
#define PID16                            BANKMASK(I3C1PID2), 0, b
#define PID17                            BANKMASK(I3C1PID2), 1, b
#define PID18                            BANKMASK(I3C1PID2), 2, b
#define PID19                            BANKMASK(I3C1PID2), 3, b
#define PID2                             BANKMASK(I3C1PID0), 2, b
#define PID20                            BANKMASK(I3C1PID2), 4, b
#define PID21                            BANKMASK(I3C1PID2), 5, b
#define PID22                            BANKMASK(I3C1PID2), 6, b
#define PID23                            BANKMASK(I3C1PID2), 7, b
#define PID24                            BANKMASK(I3C1PID3), 0, b
#define PID25                            BANKMASK(I3C1PID3), 1, b
#define PID26                            BANKMASK(I3C1PID3), 2, b
#define PID27                            BANKMASK(I3C1PID3), 3, b
#define PID28                            BANKMASK(I3C1PID3), 4, b
#define PID29                            BANKMASK(I3C1PID3), 5, b
#define PID3                             BANKMASK(I3C1PID0), 3, b
#define PID30                            BANKMASK(I3C1PID3), 6, b
#define PID31                            BANKMASK(I3C1PID3), 7, b
#define PID32                            BANKMASK(I3C1PID4), 0, b
#define PID33                            BANKMASK(I3C1PID4), 1, b
#define PID34                            BANKMASK(I3C1PID4), 2, b
#define PID35                            BANKMASK(I3C1PID4), 3, b
#define PID36                            BANKMASK(I3C1PID4), 4, b
#define PID37                            BANKMASK(I3C1PID4), 5, b
#define PID38                            BANKMASK(I3C1PID4), 6, b
#define PID39                            BANKMASK(I3C1PID4), 7, b
#define PID4                             BANKMASK(I3C1PID0), 4, b
#define PID40                            BANKMASK(I3C1PID5), 0, b
#define PID41                            BANKMASK(I3C1PID5), 1, b
#define PID42                            BANKMASK(I3C1PID5), 2, b
#define PID43                            BANKMASK(I3C1PID5), 3, b
#define PID44                            BANKMASK(I3C1PID5), 4, b
#define PID45                            BANKMASK(I3C1PID5), 5, b
#define PID46                            BANKMASK(I3C1PID5), 6, b
#define PID47                            BANKMASK(I3C1PID5), 7, b
#define PID5                             BANKMASK(I3C1PID0), 5, b
#define PID6                             BANKMASK(I3C1PID0), 6, b
#define PID7                             BANKMASK(I3C1PID0), 7, b
#define PID8                             BANKMASK(I3C1PID1), 0, b
#define PID9                             BANKMASK(I3C1PID1), 1, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
